"""
Special mathematical characters
"""

div = "÷"
mul = "×"
overline = "̄"
sgn = "±"
strikethrough = "̶"
subscript = "₀₁₂₃₄₅₆₇₈₉₊₋₌₍₎ₐₑₕᵢⱼₖₗₘₙₒₚᵣₛₜᵤᵥₓ"
superscript = "⁰¹²³⁴⁵⁶⁷⁸⁹⁺⁻⁼⁽⁾ᴬᴮᴰᴱᴳᴴᴵᴶᴷᴸᴹᴺᴼᴾᴿᵀᵁⱽᵂᵃᵇᶜᵈᵉᶠᵍʰⁱʲᵏˡᵐⁿᵒᵖʳˢᵗᵘᵛʷˣʸᶻᵋᵝᵟᵠᶿ"
underline = "_"
arrow = [
    ["↖", "↑", "↗"],
    ["←", "⇌", "→"],
    ["↙", "↓", "↘"],
    ["↔", "⇋", "↕"],
    ["⇐", "⇔", "⇒"]
]
tab = [
    ["┌", "┬", "┐"],
    ["├", "┼", "┤"],
    ["└", "┴", "┘"],
    ["─", "╭", "╮"],
    ["│", "╰", "╯"]
]
pi = "Ππ𝜫𝝅𝝥𝝿𝞟𝞹Пп∏ϖ∐ℼㄇ兀"
others = "¬°‰‱′″∀∂∃∅∆∇∈∉∏∐∑∝∞∟∠∣∥∧∨∩∪∫∬∭∮∯∰∴∵∷∽≈≌≒≠≡≢≤≥≪≫≮≯≰≱≲≳⊕⊙⊥⊿⌒㏑㏒"
